const handler = async (m, {conn}) => {
  m.reply(global.bsmasc);
};
handler.command = /^(bsmasc|buscarvsmasc)$/i;
handler.tags = ['free'];
handler.help = ['buscarvsmasc'];
export default handler;
handler.admin = true
handler.group = true
handler.botAdmin = true

global.bsmasc = `
🗣️⋆ ☇  𝘽𝙐𝙎𝘾𝙊 𝙑𝙎 𝙈𝘼𝙎𝘾  👺

          ›› 𝗛𝗼𝗿𝗮 ¦ 𝗠𝗼𝗱↷ 👺
𝙈𝙤𝙙𝙖𝙡𝙞𝙙𝙖𝙙:
☁❩ 16:00 🇨🇱🇦🇷 ⌇ 14:00 🇵🇪
🔱𝙈𝙤𝙙𝙖𝙡𝙞𝙙𝙖𝙙:
☁❩ 18:00 🇨🇱🇦🇷 ⌇ 16:00 🇵🇪
🔱𝙈𝙤𝙙𝙖𝙡𝙞𝙙𝙖𝙙:
☁❩ 20:00 🇨🇱🇦🇷 ⌇ 18:00 🇵🇪
🔱𝙈𝙤𝙙𝙖𝙡𝙞𝙙𝙖𝙙:
☁❩ 22:00 🇨🇱🇦🇷 ⌇ 20:00 🇵🇪 
🔱𝙈𝙤𝙙𝙖𝙡𝙞𝙙𝙖𝙙:
☁❩ 00:00 🇨🇱🇦🇷 ⌇ 22:00 🇵🇪

⊹ ִֶָ  🌩️Mis reglas, No modifico
⊹ ִֶָ  🌩️1 🖥
⊹ ִֶָ  🌩️Hablar con IG si o si.
⊹ ִֶָ  🌩️Con logo en mano

🔱𝗛𝗮𝗯𝗹𝗮𝗿:🔱
wa.me/
wa.me/
`;
